---
kind: type
id: T:Autodesk.Revit.DB.ViewSheetSetting
source: html/e85ce148-ef47-7640-1864-6035b6773411.htm
---
# Autodesk.Revit.DB.ViewSheetSetting

Represents the View/Sheet Set (Application Menu->Print) within Autodesk Revit.

## Syntax (C#)
```csharp
public class ViewSheetSetting : APIObject
```